## ✍ 변수(Variable)

### 변수
- '이름이 붙은 저장소' / '이름이 붙은 상자'📦 
- let 키워드를 이용하여 변수를 생성(선언)한다. (var 사용 X)
- 재선언 불가 (같은 변수 여러번 선언 시 에러발생)
- 재할당 가능 (원하는 값으로, 어떤 자료형으로든 변경가능)

### 변수의 초기화란?
- 변수를 선언 + 값을 할당하는 것을 의미한다.
✅ let name = 'doopal';
❎ let age;   // 선언만 하고 초기화 하지 않음. 이 때 변수의 값 == undefined.

### 변수 명명 규칙
-변수명에는 문자와 숫자, 기호 $ 와 _ 만 들어갈 수 있다.
- 첫 글자로 숫자가 올 수 없다.
- 공백 불가능
- 예약어는 사용할 수 없다. (ex. class / null / if / for / let 등)
- 대 / 소문자 구별  (ex. 변수명 doopal 과 DooPal은 서로 다른 변수이다.)

### 변수 명명 tip
- 띄어쓰기가 불가능 하니 여러 단어로 변수명을 명명할 때에는 카멜표기법(camelCase)을 주로 사용한다. 
- 변수명은 간결+명확하게. 의미 없는 이름을 변수명으로 쓰지 않기
(추후 프로그램 규모가 커지고 복잡 해지게 되면, 공동작업 시 불편한 상황이 생길 수 있고
함수명을 a, x, y 등으로 의미 없이 짓게 되면 어떤 값을 저장해뒀는지 찾기 어려워 활용하기 어렵다 !)

```javascript
//❔ Question
// 1. 현재 우리가 살고있는 행성(planet)의 이름을 값으로 가진 변수를 만들어보세요. 
// 변수 이름을 어떻게 지어야 할까요?

// 🤢 my answer
const planet = earth;

// 🤩 recommendation
// planet 이라고만 하면 어떤 행성을 말하는지 모호할 수 있다.
// ourPlanetName 이라는 구체적인 이름을 사용해보자. (너무 길지만 않다면!)
const ourPlanetName = earth;

// 2. 웹사이트를 개발중입니다. 현재 접속중인 사용자(user)의 이름(name)을
// 저장하는 변수를 만들어 보세요. 변수 이름을 어떻게 지어야 할까요?
// 🤗 my answer
let currentUserName = 'doopal';

// 🤩 recommendation
// 위 문제와 마찬가지로 그냥 'userName' 보다는 
// 좀 더 직관적으로 '현재 접속중'이라는 정보를 담고있는 이름으로 지어주는 것이 좋다.
```

## ✍ 상수 (Constant)
- 값이 바뀔 일이 없는 데이터를 선언할 때 사용
- const 키워드를 사용하여 변수를 선언한다.
- 재선언 불가 / 재할당 불가. 상수를 변경하려고 하면 에러가 발생한다.
- 변수 선언에는 기본적으로 const를 사용하고,
재할당이 필요한 경우에 한정하여 let을 사용하는것을 권장. 의도하지 않은 재할당을 방지해준다.
- 여러 곳에서 사용 될 공통 값인 경우, 변수명을 대문자와 밑줄(_)로 명명해준다. 
👉 ex. const PI = 3.14;    /  const COLOR_RED = '#F00';
👉 기억하기 쉽고 / 오타낼 확률이 적으며 / 코드 가독성이 증가한다.